2.1 穷竭搜索
    1，递归函数
    2，栈
    3，队列
    4，DFS
    5，BFS
2.2 贪心法
    1，硬币问题
    2，区间问题
    3，字典序最小问题
2.3 动态规划-DP
    1，01背包问题
        递归并记录结果
        递推关系
    2，完全背包问题
    3，01背包问题-2
    4，多重部分和问题
    5，最长上升子序列问题
    6，有关计数问题的DP
    7，多重集组合数
2.4 加工并存储数据的数据结构
    1，堆的实现
    2，编程语言的标准库
    3，Expedition-加油站问题
    4，二叉搜索树的实现
    5，编程语言的标准库-2
    6，平衡二叉树
    7，并查集的实现
    8，食物链问题
2.5 图
    1,二分图判定
    2，最短路问题
        1，单源最短路问题1  Bellman-Ford算法
        2，单源最短路问题2  Dijkstra算法
        3，任意两点间的最短路问题  Floyd-Warshall算法
        4，路径还原
    3，最小生成树
        1，Prim算法
        2，Kruskal算法
    4，Roadblocks问题
    5，Conscription问题
    6，Layout问题
2.6 数学问题
2.7 GCJ例题